core/app/Http/Controllers/HomeController.php

select * from `sliders` where (`status` = 1) order by `order_column` asc
select * from `products` where (`status` = 1) order by `order_column` asc
select * from `orders` where `orders`.`deleted_at` is null order by `created_at` desc limit 5
select * from `users` where `users`.`id` in (1, 3976, 3978)
select * from `variations` where `variations`.`id` in (253)
select * from `categories` where `status` = 1 order by `slot` asc
---
    public function home()
    {
        $sliders = Slider::with('media')
            ->where(['status' => Status::ACTIVE])
            ->orderBy('order_column')
            ->get();
        $products = Product::with('media')
            ->where(['status' => Status::ACTIVE])
            ->orderBy('order_column')
            ->get();
        $orders = Order::with(['user', 'variation'])
            ->latest()
            ->take(5)
            ->get();
        $categories = Categorie::where('status', 1)->orderBy('slot', 'asc')->get();

select * from `products` where `status` = 1 and (`slug` = 'ff') limit 1
select * from `variations` where `variations`.`product_id` in (36)
select * from `vouchers` where `vouchers`.`variation_id` in (253) and `status` = 1
---
    public function topup(string $slug)
    {
        $product = Product::with(['variations.vouchers' => function ($query) {
            $query->where('status', Status::AVAILABLE);
        }])->where('status', Status::ACTIVE)->where(['slug' => $slug])->first();

select * from `popups` where `status` = 1
---
    public function getPopups(Collection $collection, Request $request)
    {
        $popupQuery = Popup::query();
            $firstVisitPopups = $popupQuery->where('status', Status::ACTIVE)
                ->get();