core/app/Services/OrderService.php

select * from `products` where `products`.`id` in (37)
select * from `variations` where `stock` > 0 and `variations`.`id` = '254' limit 1
select * from `vouchers` where `vouchers`.`variation_id` in (254) and `status` = 1
---
    public function addOrder(Request $request)
    {
        $variation = Variation::where('stock', '>', 0)
            ->with(['product', 'vouchers' => function ($query) {
                $query->where('status', Status::AVAILABLE);
            }])
            ->findOrFail($request->variation_id);

insert into `orders` (`user_id`, `product_id`, `variation_id`, `quantity`, `amount`, `profit`, `track_id`, `account_info`, `updated_at`, `created_at`) values (1, 37, 254, 1, 320, '20.00', '73UYFU3NS33M', '{\"player_id\":\"2523798928\"}', '2025-08-18 14:27:45', '2025-08-18 14:27:45')
---

        try {
            $order = DB::transaction(function () use ($orderData) {
                return Order::create($orderData);

select * from `orders` where `id` = 154 and `orders`.`deleted_at` is null order by `id` desc limit 1
select * from `products` where `products`.`id` in (37)
select * from `users` where `users`.`id` in (1)
select * from `variations` where `variations`.`id` in (254)
---
            return back()->with('error', __('Something went wrong.'));
        }

        $order = Order::where('id', $order->id)->orderBy('id', 'DESC')->with(['user', 'variation', 'product'])->first();

select * from `products` where `products`.`id` in (37)
select * from `variations` where `stock` > 0 and `variations`.`id` = '254' limit 1
select * from `vouchers` where `vouchers`.`variation_id` in (254) and `status` = 1
update `orders` set `status` = 'processing', `orders`.`updated_at` = '2025-08-18 14:27:45' where `id` = '154'
update `users` set `balance` = 3680, `users`.`updated_at` = '2025-08-18 14:27:45' where `id` = '1'
---
    public function completeOrderWithWallet(Order $order, string $paymentMethod, ?Voucher $vouchers = null)
    {
        if ($order->amount > auth()->user()->balance) {
            throw new \Exception(__('Insufficient Balance.'));
        }

        $variation = Variation::where('stock', '>', 0)->with(['product', 'vouchers' => function ($query) {
            $query->where('status', Status::AVAILABLE);
        }])->find($order->variation_id);

        if (!$variation) {
            throw new \Exception(__('Sorry, this product is out of stock.'));
        }

        if ($order->product->isVoucher()) {
            $vouchers = Voucher::where('status', Status::AVAILABLE)
                ->where('variation_id', $order->variation_id)
                ->limit($order->quantity)
                ->orderBy('id', 'DESC')
                ->get();

            if ($vouchers->count() < $order->quantity) {
                throw new \Exception(__('Insufficient vouchers available.'));
            }
        }

        DB::transaction(function () use ($order, $vouchers, $paymentMethod) {
            if ($order->isPending()) {
                // Update Order
                $order['status'] = ($order->product->isVoucher()) ? Status::COMPLETED : Status::PROCESSING;
                $order->update();

                // Update User
                $user = $order->user;
                $user->balance -= $order->amount;
                $user->save();

                if ($order->product->isVoucher()) {

                    // Update Variation
                    $variation = $order->variation;
                    $variation->stock -= $vouchers->count();
                    $variation->save();

                    // Update Voucher
                    $voucherCodes = [];
                    foreach ($vouchers as $index => $voucher) {

update `variations` set `stock` = 19, `variations`.`updated_at` = '2025-08-18 14:27:45' where `id` = '254'
---
                    // Update Variation
                    $variation = $order->variation;
                    $variation->stock -= 1;
                    $variation->save();

insert into `transactions` (`user_id`, `order_id`, `trx_type`, `amount`, `payment_method`, `remarks`, `transaction_id`, `updated_at`, `created_at`) values ('1', 154, '-', '320.00', 'wallet', 'Product is being purchased using the wallet, Order ID: 154', 'ZJOG987J4DSY', '2025-08-18 14:27:45', '2025-08-18 14:27:45')
---
                $transaction->remarks = "Product is being purchased using the {$paymentMethod}, Order ID: {$order->id}";
                $transactionId  = strRandom();
                $transaction->transaction_id = $transactionId;
                $transaction->save();

select * from `users` where `role` = 'admin'
---

                try {
                    if (gs()->smtp_from_address && gs()->smtp_host && gs()->smtp_password && gs()->smtp_port && gs()->smtp_username) {
                        foreach (User::where('role', Role::ADMIN)->cursor() as $admin) {

select * from `vouchers` where `order_id` = 154
select * from `auto_vouchers` where `order_id` = 154
---
            private function addTransactionId($order_id,$transactionId)
            {
                    $vouchers = Voucher::where('order_id', $order_id)->get();