core/app/Providers/AppServiceProvider.php

    public function boot(): void
    {
        $viewShare['settings'] = gs();
        view()->share($viewShare);

        try {
            View::composer('layouts.app', function ($view) {
                $pages = Page::where('status', Status::ACTIVE)
                    ->orderBy('order_column')
                    ->get();
                $menus = Menu::where('status', Status::ACTIVE)
                    ->orderBy('order_column')
                    ->get();
---
select * from `pages` where `status` = 1 order by `order_column` asc
select * from `menus` where `status` = 1 order by `order_column` asc