core/app/Http/Controllers/User/DepositControlller.php

select count(*) as aggregate from `deposits` where `user_id` = 20
---
    public function index()
    {
        if (!gs()->wallet) {
            abort(403, 'Access denied.');
        }

        $deposits = Deposit::with(['transaction'])
            ->where('user_id', user_id())
            ->latest()
            ->paginate(gs()->paginate_per_page);