core/app/Filament/Widgets/StatsOverviewWidget.php

select sum(`amount`) as aggregate from `orders` where month(`created_at`) = '08' and `status` = 'completed' and `orders`.`deleted_at` is null
select sum(`amount`) as aggregate from `orders` where month(`created_at`) = '07' and `status` = 'completed' and `orders`.`deleted_at` is null
---
    private function calculateRevenueIncreaseByDate(): array
    {
        $currentRevenue = Order::whereMonth('created_at', now()->month)
            ->where('status', Status::COMPLETED)
            ->sum('amount');
        $previousRevenue = Order::whereMonth('created_at', now()->month - 1)
            ->where('status', Status::COMPLETED)
            ->sum('amount');

select count(*) as aggregate from `orders` where month(`created_at`) = '08' and `orders`.`deleted_at` is null
select count(*) as aggregate from `orders` where month(`created_at`) = '07' and `orders`.`deleted_at` is null
---
    private function calculateOrderIncreaseByDate(): array
    {
        $currentOrders = Order::whereMonth('created_at', now()->month)->count();
        $previousOrders = Order::whereMonth('created_at', now()->month - 1)->count();

select count(*) as aggregate from `users` where month(`created_at`) = '08' and `role` = 'user'
select count(*) as aggregate from `users` where month(`created_at`) = '07' and `role` = 'user'
---
    private function calculateUserIncreaseByDate(): array
    {
        $currentUsers = User::whereMonth('created_at', now()->month)
            ->where('role', Role::USER)
            ->count();
        $previousUsers = User::whereMonth('created_at', now()->month - 1)
            ->where('role', Role::USER)
            ->count();